Revit 2027 API
MultiSegmentGrid.AreGridsInSameMultiSegmentGrid Method
 Determine whether two Grids are members of the same GridChain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreGridsInSameMultiSegmentGrid(
	Grid grid1,
	Grid grid2
)
Public Shared Function AreGridsInSameMultiSegmentGrid (
	grid1 As Grid,
	grid2 As Grid
) As Boolean
public:
static bool AreGridsInSameMultiSegmentGrid(
	Grid^ grid1,
	Grid^ grid2
)
static member AreGridsInSameMultiSegmentGrid :
        grid1 : Grid *
        grid2 : Grid -> bool
Parameters
grid1 Grid
 A Grid.
grid2 Grid
 A Grid.
Return Value
Boolean
 Returns true if both of the specified Grids are associated to the same MultiSegmentGrid, i.e. getMultiSegementGridId returns the same valid element id for both Grids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace